akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
anthropic.claude-code
armandphilippot.coldark
charliermarsh.ruff
davidanson.vscode-markdownlint
fabiospampinato.vscode-highlight
foam.foam-vscode
github.copilot
github.copilot-chat
github.github-vscode-theme
google.colab
gruntfuggly.todo-tree
llvm-vs-code-extensions.vscode-clangd
meta.pyrefly
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
pkief.markdown-checkbox
prettier.prettier-vscode
shd101wyy.markdown-preview-enhanced
usernamehw.todo-md
vscodevim.vim
wbk.datehighlighter
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
